env/std_environment.org
#+AUTHOR: Jeff Garland
#+TITLE: D2768R0  ~std::environment~
#+EMAIL: jeff@crystalclearsoftware.com
#+REVISION: 1
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+options: num:nil
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [11pt]
#+LaTeX_HEADER: \usepackage[letterpaper,margin=.75in,top=.75in,bottom=.75in]{geometry}
#+LaTeX_HEADER: \usepackage[frame=lines, linenos=true]{minted}
#+LaTeX_HEADER: \usepackage{pdfpages}

*Authors:*
    Jeff Garland

*Audience:*
    SG16, LEWG

*Project:*
    ISO/IEC JTC1/SC22/WG21 14882: Programming Language — C++

*Contact:*
    jeff@crystalclearsoftware.com


* Introduction
Interaction with the operating system environment settings is needed in many C++ applications. Currently the only portable function available is [[https://en.cppreference.com/w/cpp/utility/program/getenv][~std::getenv~]] which provides a C style api.  This is insufficient to support many modern C++ programs.  It is also an unsafe API.

This paper draws inspiration and requirements from earlier work by [[https://wg21.link/p1275][Isabella Muerte (P1275)]] and [[https://wg21.link/P1750][P1750 A Proposal to Add Process Management to the C++ Standard Library]]. However, it does not propose ~std::args~ as in P1275. It does support facilities needed by std::process~ including functions to write to the environment.

#+begin_quote
#+end_quote
* Motivation and Scope

Currently the only C++ supported api is inherited from C as shown below.
#+BEGIN_SRC C++
#include <cstdlib>
 
int main()
{
    if( const char* path = std::getenv("PATH") )
        std::println("PATH: {}", path);
}
#+END_SRC

This function returns a pointer that points at static data which may be reallocated by the platform if the environment is written by posix function such as ~setenv~.  In addition, the pointer is subject to data races in multi-threaded programs.  In addition, it is insufficient to discover the list of environment settings for the program. 





This paper advocates for a library addition, ~std::environment~ that provides portable application development.


Before the change we'd write this:

| Before |
#+BEGIN_SRC C++
  time_expected d = from_iso_str( ts );
  if (d)
  {
     ptime t = next_day( *d );
  } 
  else
  {
     print_error( d.error() );
  }
#+END_SRC

And after, this:

| After |

#+BEGIN_SRC C++
   // chain a series of functions until there's an error
   auto d = from_iso_str ( ts )
                  .or_else( print_error )
                  .transform( next_day ) ;
#+END_SRC

* Design Considerations

The following sections discuss various aspects of the design the committee should consider and decide.

** API Scope -- No Command Line Arguments?
Several languages bundle environment access and command line arguments as related entities.  The original [P1275 https://wg21.link/p1275]  

  1. [P1275] Isabella Muerte 

Common themes 

- optional like access
- existence check
- range based access


** Thread and Memory Safety
The environment of a running process on common platforms is global data.  Making modifications to this data from multiple threads and reading from others can cause data races.  C++ is not in a position to change the reality of these platforms so at a minimum it needs to be documented.

Even worse, keeping a reference to the data is not safe either as the underlying platform may relocate 

TODO: an example


As an example, POSIX platforms document that ~getenv~ is 

#+BEGIN_NOTES

Rust discussion on thread safety https://austingroupbugs.net/view.php?id=188
GLIBC discussion https://sourceware.org/bugzilla/show_bug.cgi?id=15607#c2
https://github.com/rust-lang/rust/pull/24741

#+END_NOTES

** Freestanding and Platform Support

There are more than a few platforms that do not support the concept of the process environment.  There needs to be a way for those platforms to opt out of support.  As a result, this proposal does not mark the facilities as freestanding. 

To quote Ben Craig on this point: "Philosophical reason: The environment is global state from the operating environment.  Freestanding attempts to avoid global state and interaction with the operating environment."

TODO: question to Ben Craig

** Unicode
** API to Write Environment
An API to set environment variables is important for many applications, but especially those that spawn child processes. Posix API's include ~putenv~, ~setenv~, and ~unsetenv~.  The ~putenv~ design is inherently unsafe and will not be considered further -- see [[https://stackoverflow.com/questions/5873029/questions-about-putenv-and-setenv][this stckoverflow discussion]] for details.





** ~expected<void, E>~

