env/std_environment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-15 Sun 04:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>P2xxx  <code>std::environment</code></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jeff Garland" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">P2xxx  <code>std::environment</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6106a4d">Introduction</a></li>
<li><a href="#org0b07329">Motivation and Scope</a></li>
<li><a href="#org08c2e49">Design Considerations</a>
<ul>
<li><a href="#org2c2a58d">API Scope &#x2013; No Command Line Arguments?</a></li>
<li><a href="#org13999e1">Thread and Memory Safety</a></li>
<li><a href="#org9a010dd">Freestanding and Platform Support</a></li>
<li><a href="#orgdb1c3cd">Unicode</a></li>
<li><a href="#org9f46a82">API to Write Environment</a></li>
<li><a href="#orga6d5217"><code>expected&lt;void, E&gt;</code></a></li>
<li><a href="#orgb77691a">Adding <code>error_or</code> functions</a></li>
</ul>
</li>
<li><a href="#orgbd45871">Other Languages and Libraries</a>
<ul>
<li><a href="#orga8aa02c">C</a></li>
<li><a href="#orgfbca371">Boost Process - environment</a></li>
<li><a href="#org043e590">Windows</a></li>
<li><a href="#org3bd8c54">Python</a></li>
<li><a href="#orga32fd2f">GO</a></li>
<li><a href="#org9c43b67">Rust</a></li>
<li><a href="#org5ca1b23">poco (c++)</a></li>
<li><a href="#org6e9da87">libenvpp (c++)</a></li>
<li><a href="#org4b5ac1d">QT Libraries</a></li>
</ul>
</li>
<li><a href="#org534574e">Implementations</a></li>
<li><a href="#orgfa4fc33">Wording</a>
<ul>
<li><a href="#org572e044">Feature Test Macro</a></li>
<li><a href="#org57d13a6">Class template environment [.environment]</a></li>
<li><a href="#org1814694">[expected.object.general] changes</a></li>
<li><a href="#orgf4f4cd9">Add following at the end [expected.object.obs] observers:</a></li>
</ul>
</li>
<li><a href="#orgadb441c">Acknowledgements</a></li>
<li><a href="#org6aebd84">Revision History</a></li>
<li><a href="#org14b3a66">References</a></li>
</ul>
</div>
</div>
<p>
<b>Authors:</b>
    Jeff Garland
</p>

<p>
<b>Audience:</b>
    SG16, LEWG
</p>

<p>
<b>Project:</b>
    ISO/IEC JTC1/SC22/WG21 14882: Programming Language — C++
</p>

<p>
<b>Contact:</b>
    jeff@crystalclearsoftware.com
</p>


<div id="outline-container-org6106a4d" class="outline-2">
<h2 id="org6106a4d">Introduction</h2>
<div class="outline-text-2" id="text-org6106a4d">
<p>
Interaction with the operating system environment settings is needed in many C++ applications. Currently the only portable function available is <a href="https://en.cppreference.com/w/cpp/utility/program/getenv"><code>std::getenv</code></a> which provides a C style api.  This is insufficient to support many modern C++ programs.  It is also an unsafe API.
</p>

<p>
This paper draws inspiration and requirements from earlier work by <a href="https://wg21.link/p1275">Isabella Muerte (P1275)</a> and <a href="https://wg21.link/P1750">P1750 A Proposal to Add Process Management to the C++ Standard Library</a>. However, it does not propose <code>std::args</code> as in P1275. It does support facilities needed by std::process~ including functions to write to the environment.
</p>

<blockquote>
nil</blockquote>
</div>
</div>
<div id="outline-container-org0b07329" class="outline-2">
<h2 id="org0b07329">Motivation and Scope</h2>
<div class="outline-text-2" id="text-org0b07329">
<p>
Currently the only C++ supported api is inherited from C as shown below.
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;cstdlib&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>()
{
    <span style="color: #a020f0;">if</span>( <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">path</span> = <span style="color: #008b8b;">std</span>::getenv(<span style="color: #8b2252;">"PATH"</span>) )
        <span style="color: #008b8b;">std</span>::println(<span style="color: #8b2252;">"PATH: {}"</span>, path);
}
</pre>
</div>

<p>
This function returns a pointer that points at static data which may be reallocated by the platform if the environment is written by posix function such as <code>setenv</code>.  In addition, the pointer is subject to data races in multi-threaded programs.  In addition, it is insufficient to discover the list of environment settings for the program. 
</p>





<p>
This paper advocates for a library addition, <code>std::environment</code> that provides portable application development.
</p>


<p>
Before the change we'd write this:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Before</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #228b22;">time_expected</span> <span style="color: #a0522d;">d</span> = from_iso_str( ts );
<span style="color: #a020f0;">if</span> (d)
{
   <span style="color: #228b22;">ptime</span> <span style="color: #a0522d;">t</span> = next_day( *d );
} 
<span style="color: #a020f0;">else</span>
{
   print_error( d.error() );
}
</pre>
</div>

<p>
And after, this:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">After</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #b22222;">// </span><span style="color: #b22222;">chain a series of functions until there's an error</span>
<span style="color: #a020f0;">auto</span> <span style="color: #228b22;">d</span> = from_iso_str ( ts )
               .or_else( print_error )
               .transform( next_day ) ;
</pre>
</div>
</div>
</div>

<div id="outline-container-org08c2e49" class="outline-2">
<h2 id="org08c2e49">Design Considerations</h2>
<div class="outline-text-2" id="text-org08c2e49">
<p>
The following sections discuss various aspects of the design the committee should consider and decide.
</p>
</div>

<div id="outline-container-org2c2a58d" class="outline-3">
<h3 id="org2c2a58d">API Scope &#x2013; No Command Line Arguments?</h3>
<div class="outline-text-3" id="text-org2c2a58d">
<p>
Several languages bundle environment access and command line arguments as related entities.  The original [P1275 <a href="https://wg21.link/p1275">https://wg21.link/p1275</a>]  
</p>

<ol class="org-ol">
<li>[P1275] Isabella Muerte</li>
</ol>

<p>
Common themes 
</p>

<ul class="org-ul">
<li>optional like access</li>
<li>existence check</li>
<li>range based access</li>
</ul>
</div>
</div>


<div id="outline-container-org13999e1" class="outline-3">
<h3 id="org13999e1">Thread and Memory Safety</h3>
<div class="outline-text-3" id="text-org13999e1">
<p>
The environment of a running process on common platforms is global data.  Making modifications to this data from multiple threads and reading from others can cause data races.  C++ is not in a position to change the reality of these platforms so at a minimum it needs to be documented.
</p>

<p>
Even worse, keeping a reference to the data is not safe either as the underlying platform may relocate 
</p>

<p>
TODO: an example
</p>


<p>
As an example, POSIX platforms document that <code>getenv</code> is 
</p>

<div class="NOTES">
<p>

</p>

<p>
Rust discussion on thread safety <a href="https://austingroupbugs.net/view.php?id=188">https://austingroupbugs.net/view.php?id=188</a>
GLIBC discussion <a href="https://sourceware.org/bugzilla/show_bug.cgi?id=15607#c2">https://sourceware.org/bugzilla/show_bug.cgi?id=15607#c2</a>
<a href="https://github.com/rust-lang/rust/pull/24741">https://github.com/rust-lang/rust/pull/24741</a>
</p>

</div>
</div>
</div>

<div id="outline-container-org9a010dd" class="outline-3">
<h3 id="org9a010dd">Freestanding and Platform Support</h3>
<div class="outline-text-3" id="text-org9a010dd">
<p>
There are more than a few platforms that do not support the concept of the process environment.  There needs to be a way for those platforms to opt out of support.  As a result, this proposal does not mark the facilities as freestanding. 
</p>

<p>
To quote Ben Craig on this point: "Philosophical reason: The environment is global state from the operating environment.  Freestanding attempts to avoid global state and interaction with the operating environment."
</p>

<p>
TODO: question to Ben Craig
</p>
</div>
</div>

<div id="outline-container-orgdb1c3cd" class="outline-3">
<h3 id="orgdb1c3cd">Unicode</h3>
</div>
<div id="outline-container-org9f46a82" class="outline-3">
<h3 id="org9f46a82">API to Write Environment</h3>
<div class="outline-text-3" id="text-org9f46a82">
<p>
An API to set environment variables is important for many applications, but especially those that spawn child processes. Posix API's include <code>putenv</code>, <code>setenv</code>, and <code>unsetenv</code>.  The <code>putenv</code> design is inherently unsafe and will not be considered further &#x2013; see <a href="https://stackoverflow.com/questions/5873029/questions-about-putenv-and-setenv">this stckoverflow discussion</a> for details.
</p>
</div>
</div>
