env/std_environment.org
** Adding ~error_or~ functions

It has been suggested that ~error_or~ functions be added to the proposal.  While the author is sympathetic to the suggestion, since consistency with ~optional~ for c++23 is the intent these are not proposed. These can be added later or if LEWG would prefer the author can investigate adding them in this cycle.

At 2022-06-07 LEWG telecom poll was taken to add this function.  The wording is added in R4 of the paper.

POLL: Add ~error_or~ to ~expected~ for C++23.

| Strongly Favor | Weakly Favor | Neutral | Weakly Against | Strongly Against |
|----------------+--------------+---------+----------------+------------------|
|              4 |            7 |       2 |              2 |                0 |

Attendance: 21

Author Position: N

Outcome: Consensus in favor.

As an example usage consider the following code:
| Before |
#+BEGIN_SRC C++
//before
file create_file(char const*, std::error_code&);
bool test_and_report(const error_code&);

std::error_code ec;
file f = create_file("file", ec);
if (test_and_report(ec)) { return; }

#+END_SRC

|After|
#+BEGIN_SRC C++
expected<file, error_code> create_file(char const*);
bool test_and_report(const error_code&);

auto f = create_file("file");

if (test_and_report(f.error_or({}))) { return; }

#+END_SRC

* Other Languages and Libraries

** C
https://en.cppreference.com/w/c/program/getenv


** Boost Process - environment

#+BEGIN_SRC C++

https://www.boost.org/doc/libs/1_81_0/doc/html/process/reference.html#header.boost.process.environment_hpp

namespace boost {
  namespace process {
    template<typename Char> class basic_environment;
    template<typename Char> class basic_native_environment;

    typedef basic_native_environment< char > native_environment;  // Definition of the environment for the current process. 
    typedef basic_native_environment< wchar_t > wnative_environment;  // Definition of the environment for the current process. 
    typedef basic_environment< char > environment;  // Type definition to hold a seperate environment. 
    typedef basic_environment< wchar_t > wenvironment;  // Type definition to hold a seperate environment. 
  }
  namespace this_process {

    // Get the process id of the current process. 
    int get_id();

    // Get the native handle of the current process. 
    native_handle_type native_handle();

    // Get the enviroment of the current process. 
    native_environment environment();

    // Get the enviroment of the current process. 
    wnative_environment wenvironment();

    // Get the path environment variable of the current process runs. 
    std::vector< boost::process::filesystem::path > path();
  }
}
#+END_SRC
** Windows

https://learn.microsoft.com/en-us/windows/win32/api/processenv/nf-processenv-getenvironmentstrings?redirectedfrom=MSDN

If the function fails, the return value is NULL.

#+begin_src c++
LPCH GetEnvironmentStrings();

#+end_src

#+begin_notes

The GetEnvironmentStrings function returns a pointer to a block of memory that contains the environment variables of the calling process (both the system and the user environment variables). Each environment block contains the environment variables in the following format:

Each environment block contains the environment variables in the following format:

Var1=Value1\0
Var2=Value2\0
Var3=Value3\0
...
VarN=ValueN\0\0

The name of an environment variable cannot include an equal sign (=).

Treat this memory as read-only; do not modify it directly. To add or change an environment variable, use the GetEnvironmentVariable and SetEnvironmentVariable functions.

When the block returned by GetEnvironmentStrings is no longer needed, it should be freed by calling the FreeEnvironmentStrings function.

Note that the ANSI version of this function, GetEnvironmentStringsA, returns OEM characters.
#+end_notes

