env/std_environment.html





<div id="outline-container-orga6d5217" class="outline-3">
<h3 id="orga6d5217"><code>expected&lt;void, E&gt;</code></h3>
</div>

<div id="outline-container-orgb77691a" class="outline-3">
<h3 id="orgb77691a">Adding <code>error_or</code> functions</h3>
<div class="outline-text-3" id="text-orgb77691a">
<p>
It has been suggested that <code>error_or</code> functions be added to the proposal.  While the author is sympathetic to the suggestion, since consistency with <code>optional</code> for c++23 is the intent these are not proposed. These can be added later or if LEWG would prefer the author can investigate adding them in this cycle.
</p>

<p>
At 2022-06-07 LEWG telecom poll was taken to add this function.  The wording is added in R4 of the paper.
</p>

<p>
POLL: Add <code>error_or</code> to <code>expected</code> for C++23.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Strongly Favor</th>
<th scope="col" class="org-right">Weakly Favor</th>
<th scope="col" class="org-right">Neutral</th>
<th scope="col" class="org-right">Weakly Against</th>
<th scope="col" class="org-right">Strongly Against</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">4</td>
<td class="org-right">7</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>

<p>
Attendance: 21
</p>

<p>
Author Position: N
</p>

<p>
Outcome: Consensus in favor.
</p>

<p>
As an example usage consider the following code:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Before</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #b22222;">//</span><span style="color: #b22222;">before</span>
<span style="color: #228b22;">file</span> <span style="color: #0000ff;">create_file</span>(<span style="color: #228b22;">char</span> <span style="color: #a020f0;">const</span>*, <span style="color: #008b8b;">std</span>::<span style="color: #228b22;">error_code</span>&amp;);
<span style="color: #228b22;">bool</span> <span style="color: #0000ff;">test_and_report</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">error_code</span>&amp;);

<span style="color: #008b8b;">std</span>::<span style="color: #228b22;">error_code</span> <span style="color: #a0522d;">ec</span>;
<span style="color: #228b22;">file</span> <span style="color: #a0522d;">f</span> = create_file(<span style="color: #8b2252;">"file"</span>, ec);
<span style="color: #a020f0;">if</span> (test_and_report(ec)) { <span style="color: #a020f0;">return</span>; }

</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">After</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #228b22;">expected</span>&lt;file, error_code&gt; <span style="color: #0000ff;">create_file</span>(<span style="color: #228b22;">char</span> <span style="color: #a020f0;">const</span>*);
<span style="color: #228b22;">bool</span> <span style="color: #0000ff;">test_and_report</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">error_code</span>&amp;);

<span style="color: #a020f0;">auto</span> <span style="color: #228b22;">f</span> = create_file(<span style="color: #8b2252;">"file"</span>);

<span style="color: #a020f0;">if</span> (test_and_report(f.error_or({}))) { <span style="color: #a020f0;">return</span>; }

</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-orgbd45871" class="outline-2">
<h2 id="orgbd45871">Other Languages and Libraries</h2>
<div class="outline-text-2" id="text-orgbd45871">
</div>
<div id="outline-container-orga8aa02c" class="outline-3">
<h3 id="orga8aa02c">C</h3>
<div class="outline-text-3" id="text-orga8aa02c">
<p>
<a href="https://en.cppreference.com/w/c/program/getenv">https://en.cppreference.com/w/c/program/getenv</a>
</p>
</div>
</div>


<div id="outline-container-orgfbca371" class="outline-3">
<h3 id="orgfbca371">Boost Process - environment</h3>
<div class="outline-text-3" id="text-orgfbca371">
<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #008b8b;">https</span>:<span style="color: #b22222;">//</span><span style="color: #b22222;">www.boost.org/doc/libs/1_81_0/doc/html/process/reference.html#header.boost.process.environment_hpp</span>

<span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">boost</span> {
  <span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">process</span> {
    <span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">Char</span>&gt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">basic_environment</span>;
    <span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">Char</span>&gt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">basic_native_environment</span>;

    <span style="color: #a020f0;">typedef</span> <span style="color: #228b22;">basic_native_environment</span>&lt; <span style="color: #228b22;">char</span> &gt; <span style="color: #228b22;">native_environment</span>;  <span style="color: #b22222;">// </span><span style="color: #b22222;">Definition of the environment for the current process. </span>
    <span style="color: #a020f0;">typedef</span> <span style="color: #228b22;">basic_native_environment</span>&lt; <span style="color: #228b22;">wchar_t</span> &gt; <span style="color: #228b22;">wnative_environment</span>;  <span style="color: #b22222;">// </span><span style="color: #b22222;">Definition of the environment for the current process. </span>
    <span style="color: #a020f0;">typedef</span> <span style="color: #228b22;">basic_environment</span>&lt; <span style="color: #228b22;">char</span> &gt; <span style="color: #228b22;">environment</span>;  <span style="color: #b22222;">// </span><span style="color: #b22222;">Type definition to hold a seperate environment. </span>
    <span style="color: #a020f0;">typedef</span> <span style="color: #228b22;">basic_environment</span>&lt; <span style="color: #228b22;">wchar_t</span> &gt; <span style="color: #228b22;">wenvironment</span>;  <span style="color: #b22222;">// </span><span style="color: #b22222;">Type definition to hold a seperate environment. </span>
  }
  <span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">this_process</span> {

    <span style="color: #b22222;">// </span><span style="color: #b22222;">Get the process id of the current process. </span>
    <span style="color: #228b22;">int</span> <span style="color: #0000ff;">get_id</span>();

    <span style="color: #b22222;">// </span><span style="color: #b22222;">Get the native handle of the current process. </span>
    <span style="color: #228b22;">native_handle_type</span> <span style="color: #0000ff;">native_handle</span>();

    <span style="color: #b22222;">// </span><span style="color: #b22222;">Get the enviroment of the current process. </span>
    <span style="color: #228b22;">native_environment</span> <span style="color: #0000ff;">environment</span>();

    <span style="color: #b22222;">// </span><span style="color: #b22222;">Get the enviroment of the current process. </span>
    <span style="color: #228b22;">wnative_environment</span> <span style="color: #0000ff;">wenvironment</span>();

    <span style="color: #b22222;">// </span><span style="color: #b22222;">Get the path environment variable of the current process runs. </span>
    <span style="color: #008b8b;">std</span>::<span style="color: #228b22;">vector</span>&lt; <span style="color: #008b8b;">boost</span>::<span style="color: #008b8b;">process</span>::<span style="color: #008b8b;">filesystem</span>::path &gt; <span style="color: #0000ff;">path</span>();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org043e590" class="outline-3">
<h3 id="org043e590">Windows</h3>
<div class="outline-text-3" id="text-org043e590">
<p>
<a href="https://learn.microsoft.com/en-us/windows/win32/api/processenv/nf-processenv-getenvironmentstrings?redirectedfrom=MSDN">https://learn.microsoft.com/en-us/windows/win32/api/processenv/nf-processenv-getenvironmentstrings?redirectedfrom=MSDN</a>
</p>

<p>
If the function fails, the return value is NULL.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #228b22;">LPCH</span> <span style="color: #0000ff;">GetEnvironmentStrings</span>();

</pre>
</div>

<div class="notes">
<p>

</p>

<p>
The GetEnvironmentStrings function returns a pointer to a block of memory that contains the environment variables of the calling process (both the system and the user environment variables). Each environment block contains the environment variables in the following format:
</p>

<p>
Each environment block contains the environment variables in the following format:
</p>

<p>
Var1=Value1\0
Var2=Value2\0
Var3=Value3\0
&#x2026;
VarN=ValueN\0\0
</p>

<p>
The name of an environment variable cannot include an equal sign (=).
</p>

<p>
Treat this memory as read-only; do not modify it directly. To add or change an environment variable, use the GetEnvironmentVariable and SetEnvironmentVariable functions.
</p>

<p>
When the block returned by GetEnvironmentStrings is no longer needed, it should be freed by calling the FreeEnvironmentStrings function.
</p>

<p>
Note that the ANSI version of this function, GetEnvironmentStringsA, returns OEM characters.
</p>

</div>
</div>
</div>
