env/std_environment.org
** Python

https://docs.python.org/3/library/os.html#os.getenv

https://docs.python.org/3/library/os.html#os.environ

#+begin_src python

import os
print(os.environ['HOME'])

# print all
print(os.environ) 

# Returns `None` if the key doesn't exist
print(os.environ.get('KEY_THAT_MIGHT_EXIST'))

# Returns `default_value` if the key doesn't exist
print(os.environ.get('KEY_THAT_MIGHT_EXIST', default_value))

# Returns `default_value` if the key doesn't exist
print(os.getenv('KEY_THAT_MIGHT_EXIST', default_value))

#+end_src

#+BEGIN_NOTES
    A mapping object where keys and values are strings that represent the process environment. For example, environ['HOME'] is the pathname of your home directory (on some platforms), and is equivalent to getenv("HOME") in C.

    This mapping is captured the first time the os module is imported, typically during Python startup as part of processing site.py. Changes to the environment made after this time are not reflected in os.environ, except for changes made by modifying os.environ directly.

    This mapping may be used to modify the environment as well as query the environment. putenv() will be called automatically when the mapping is modified.

    On Unix, keys and values use sys.getfilesystemencoding() and 'surrogateescape' error handler. Use environb if you would like to use a different encoding.

    Note

    Calling putenv() directly does not change os.environ, so it’s better to modify os.environ.

    Note

    On some platforms, including FreeBSD and macOS, setting environ may cause memory leaks. Refer to the system documentation for putenv().

    You can delete items in this mapping to unset environment variables. unsetenv() will be called automatically when an item is deleted from os.environ, and when one of the pop() or clear() methods is called.

    Changed in version 3.9: Updated to support PEP 584’s merge (|) and update (|=) operators.

#+END_NOTES

https://docs.python.org/3/library/os.html#os.putenv
#+BEGIN_NOTES

    Set the environment variable named key to the string value. Such changes to the environment affect subprocesses started with os.system(), popen() or fork() and execv().

    Assignments to items in os.environ are automatically translated into corresponding calls to putenv(); however, calls to putenv() don’t update os.environ, so it is actually preferable to assign to items of os.environ. This also applies to getenv() and getenvb(), which respectively use os.environ and os.environb in their implementations.

    Note

    On some platforms, including FreeBSD and macOS, setting environ may cause memory leaks. Refer to the system documentation for putenv().

    Raises an auditing event os.putenv with arguments key, value.

    Changed in version 3.9: The function is now always available.


#+END_NOTES

https://docs.python.org/3/library/os.html#os.unsetenv
#+BEGIN_NOTES
    Unset (delete) the environment variable named key. Such changes to the environment affect subprocesses started with os.system(), popen() or fork() and execv().

    Deletion of items in os.environ is automatically translated into a corresponding call to unsetenv(); however, calls to unsetenv() don’t update os.environ, so it is actually preferable to delete items of os.environ.

    Raises an auditing event os.unsetenv with argument key.

    Changed in version 3.9: The function is now always available and is also available on Windows.

#+END_NOTES

** GO

#+begin_src go

some_var := os.Getenv("SOME_VAR")

os.Setenv("NAME", "gopher")
os.Setenv("BURROW", "/usr/gopher")
fmt.Println(os.ExpandEnv("$NAME lives in ${BURROW}."))

val, ok := os.LookupEnv(key)
if !ok {
  fmt.Printf("%s not set\n", key)
}

// func LookupEnv(key string) (string, bool)
// func Setenv(key, value string) error
// func Unsetenv(key string) error
// func Environ() []string

for _, vars := range os.Environ() {
        envPair := strings.SplitN(variables, "=", 2)
        fmt.Println(envPair[0]) 
}

#+end_src

https://pkg.go.dev/os#Clearenv
https://pkg.go.dev/os#Environ
https://pkg.go.dev/os#ExpandEnv
https://pkg.go.dev/os#LookupEnv
https://pkg.go.dev/os#Setenv
** Rust
Rust provides an ~std::env~ object 

https://doc.rust-lang.org/std/env/index.html


And low level functions 

remove_var

https://doc.rust-lang.org/std/env/fn.remove_var.html



** poco (c++)

#+begin_src c++

// Throws a NotFoundException if the variable does not exist.
static std::string get(const std::string & name, const std::string & defaultValue);
static void set(const std::string & name, const std::string & value);
static bool has(const std::string & name);

#+end_src

https://docs.pocoproject.org/current/Poco.Environment.html#13404


** libenvpp (c++)

Prefix based enivironment access

https://github.com/ph3at/libenvpp




** QT Libraries

https://doc.qt.io/qt-5/qtglobal.html#qgetenv
https://doc.qt.io/qt-5/qtglobal.html#qputenv
https://doc.qt.io/qt-5/qbytearray.html

https://doc.qt.io/qt-5/qtglobal.html#qEnvironmentVariableIsSet
https://doc.qt.io/qt-5/qtglobal.html#qEnvironmentVariableIsEmpty

* Implementations

* Wording
** Feature Test Macro  

Set the ~__cpp_lib_environment~ feature test macro.

