env/std_environment.html

<div id="outline-container-org3bd8c54" class="outline-3">
<h3 id="org3bd8c54">Python</h3>
<div class="outline-text-3" id="text-org3bd8c54">
<p>
<a href="https://docs.python.org/3/library/os.html#os.getenv">https://docs.python.org/3/library/os.html#os.getenv</a>
</p>

<p>
<a href="https://docs.python.org/3/library/os.html#os.environ">https://docs.python.org/3/library/os.html#os.environ</a>
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #a020f0;">import</span> os
<span style="color: #a020f0;">print</span>(os.environ[<span style="color: #8b2252;">'HOME'</span>])

<span style="color: #b22222;"># </span><span style="color: #b22222;">print all</span>
<span style="color: #a020f0;">print</span>(os.environ) 

<span style="color: #b22222;"># </span><span style="color: #b22222;">Returns `None` if the key doesn't exist</span>
<span style="color: #a020f0;">print</span>(os.environ.get(<span style="color: #8b2252;">'KEY_THAT_MIGHT_EXIST'</span>))

<span style="color: #b22222;"># </span><span style="color: #b22222;">Returns `default_value` if the key doesn't exist</span>
<span style="color: #a020f0;">print</span>(os.environ.get(<span style="color: #8b2252;">'KEY_THAT_MIGHT_EXIST'</span>, default_value))

<span style="color: #b22222;"># </span><span style="color: #b22222;">Returns `default_value` if the key doesn't exist</span>
<span style="color: #a020f0;">print</span>(os.getenv(<span style="color: #8b2252;">'KEY_THAT_MIGHT_EXIST'</span>, default_value))

</pre>
</div>

<div class="NOTES">
<p>
A mapping object where keys and values are strings that represent the process environment. For example, environ['HOME'] is the pathname of your home directory (on some platforms), and is equivalent to getenv("HOME") in C.
</p>

<p>
This mapping is captured the first time the os module is imported, typically during Python startup as part of processing site.py. Changes to the environment made after this time are not reflected in os.environ, except for changes made by modifying os.environ directly.
</p>

<p>
This mapping may be used to modify the environment as well as query the environment. putenv() will be called automatically when the mapping is modified.
</p>

<p>
On Unix, keys and values use sys.getfilesystemencoding() and 'surrogateescape' error handler. Use environb if you would like to use a different encoding.
</p>

<p>
Note
</p>

<p>
Calling putenv() directly does not change os.environ, so it’s better to modify os.environ.
</p>

<p>
Note
</p>

<p>
On some platforms, including FreeBSD and macOS, setting environ may cause memory leaks. Refer to the system documentation for putenv().
</p>

<p>
You can delete items in this mapping to unset environment variables. unsetenv() will be called automatically when an item is deleted from os.environ, and when one of the pop() or clear() methods is called.
</p>

<p>
Changed in version 3.9: Updated to support PEP 584’s merge (|) and update (|=) operators.
</p>

</div>

<p>
<a href="https://docs.python.org/3/library/os.html#os.putenv">https://docs.python.org/3/library/os.html#os.putenv</a>
</p>
<div class="NOTES">
<p>

</p>

<p>
Set the environment variable named key to the string value. Such changes to the environment affect subprocesses started with os.system(), popen() or fork() and execv().
</p>

<p>
Assignments to items in os.environ are automatically translated into corresponding calls to putenv(); however, calls to putenv() don’t update os.environ, so it is actually preferable to assign to items of os.environ. This also applies to getenv() and getenvb(), which respectively use os.environ and os.environb in their implementations.
</p>

<p>
Note
</p>

<p>
On some platforms, including FreeBSD and macOS, setting environ may cause memory leaks. Refer to the system documentation for putenv().
</p>

<p>
Raises an auditing event os.putenv with arguments key, value.
</p>

<p>
Changed in version 3.9: The function is now always available.
</p>

</div>

<p>
<a href="https://docs.python.org/3/library/os.html#os.unsetenv">https://docs.python.org/3/library/os.html#os.unsetenv</a>
</p>
<div class="NOTES">
<p>
Unset (delete) the environment variable named key. Such changes to the environment affect subprocesses started with os.system(), popen() or fork() and execv().
</p>

<p>
Deletion of items in os.environ is automatically translated into a corresponding call to unsetenv(); however, calls to unsetenv() don’t update os.environ, so it is actually preferable to delete items of os.environ.
</p>

<p>
Raises an auditing event os.unsetenv with argument key.
</p>

<p>
Changed in version 3.9: The function is now always available and is also available on Windows.
</p>

</div>
</div>
</div>

<div id="outline-container-orga32fd2f" class="outline-3">
<h3 id="orga32fd2f">GO</h3>
<div class="outline-text-3" id="text-orga32fd2f">
<div class="org-src-container">
<pre class="src src-go">
some_var := os.Getenv("SOME_VAR")

os.Setenv("NAME", "gopher")
os.Setenv("BURROW", "/usr/gopher")
fmt.Println(os.ExpandEnv("$NAME lives in ${BURROW}."))

val, ok := os.LookupEnv(key)
if !ok {
  fmt.Printf("%s not set\n", key)
}

// func LookupEnv(key string) (string, bool)
// func Setenv(key, value string) error
// func Unsetenv(key string) error
// func Environ() []string

for _, vars := range os.Environ() {
        envPair := strings.SplitN(variables, "=", 2)
        fmt.Println(envPair[0]) 
}

</pre>
</div>

<p>
<a href="https://pkg.go.dev/os#Clearenv">https://pkg.go.dev/os#Clearenv</a>
<a href="https://pkg.go.dev/os#Environ">https://pkg.go.dev/os#Environ</a>
<a href="https://pkg.go.dev/os#ExpandEnv">https://pkg.go.dev/os#ExpandEnv</a>
<a href="https://pkg.go.dev/os#LookupEnv">https://pkg.go.dev/os#LookupEnv</a>
<a href="https://pkg.go.dev/os#Setenv">https://pkg.go.dev/os#Setenv</a>
</p>
</div>
</div>
<div id="outline-container-org9c43b67" class="outline-3">
<h3 id="org9c43b67">Rust</h3>
<div class="outline-text-3" id="text-org9c43b67">
<p>
Rust provides an <code>std::env</code> object 
</p>

<p>
<a href="https://doc.rust-lang.org/std/env/index.html">https://doc.rust-lang.org/std/env/index.html</a>
</p>


<p>
And low level functions 
</p>

<p>
remove<sub>var</sub>
</p>

<p>
<a href="https://doc.rust-lang.org/std/env/fn.remove_var.html">https://doc.rust-lang.org/std/env/fn.remove_var.html</a>
</p>
</div>
</div>



<div id="outline-container-org5ca1b23" class="outline-3">
<h3 id="org5ca1b23">poco (c++)</h3>
<div class="outline-text-3" id="text-org5ca1b23">
<div class="org-src-container">
<pre class="src src-c++">
<span style="color: #b22222;">// </span><span style="color: #b22222;">Throws a NotFoundException if the variable does not exist.</span>
<span style="color: #a020f0;">static</span> <span style="color: #008b8b;">std</span>::<span style="color: #228b22;">string</span> <span style="color: #0000ff;">get</span>(<span style="color: #a020f0;">const</span> <span style="color: #008b8b;">std</span>::<span style="color: #228b22;">string</span> &amp; <span style="color: #a0522d;">name</span>, <span style="color: #a020f0;">const</span> <span style="color: #008b8b;">std</span>::<span style="color: #228b22;">string</span> &amp; <span style="color: #a0522d;">defaultValue</span>);
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">set</span>(<span style="color: #a020f0;">const</span> <span style="color: #008b8b;">std</span>::<span style="color: #228b22;">string</span> &amp; <span style="color: #a0522d;">name</span>, <span style="color: #a020f0;">const</span> <span style="color: #008b8b;">std</span>::<span style="color: #228b22;">string</span> &amp; <span style="color: #a0522d;">value</span>);
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">bool</span> <span style="color: #0000ff;">has</span>(<span style="color: #a020f0;">const</span> <span style="color: #008b8b;">std</span>::<span style="color: #228b22;">string</span> &amp; <span style="color: #a0522d;">name</span>);

</pre>
</div>

<p>
<a href="https://docs.pocoproject.org/current/Poco.Environment.html#13404">https://docs.pocoproject.org/current/Poco.Environment.html#13404</a>
</p>
</div>
</div>


<div id="outline-container-org6e9da87" class="outline-3">
<h3 id="org6e9da87">libenvpp (c++)</h3>
<div class="outline-text-3" id="text-org6e9da87">
<p>
Prefix based enivironment access
</p>

<p>
<a href="https://github.com/ph3at/libenvpp">https://github.com/ph3at/libenvpp</a>
</p>
</div>
</div>




<div id="outline-container-org4b5ac1d" class="outline-3">
<h3 id="org4b5ac1d">QT Libraries</h3>
<div class="outline-text-3" id="text-org4b5ac1d">
<p>
<a href="https://doc.qt.io/qt-5/qtglobal.html#qgetenv">https://doc.qt.io/qt-5/qtglobal.html#qgetenv</a>
<a href="https://doc.qt.io/qt-5/qtglobal.html#qputenv">https://doc.qt.io/qt-5/qtglobal.html#qputenv</a>
<a href="https://doc.qt.io/qt-5/qbytearray.html">https://doc.qt.io/qt-5/qbytearray.html</a>
</p>

<p>
<a href="https://doc.qt.io/qt-5/qtglobal.html#qEnvironmentVariableIsSet">https://doc.qt.io/qt-5/qtglobal.html#qEnvironmentVariableIsSet</a>
<a href="https://doc.qt.io/qt-5/qtglobal.html#qEnvironmentVariableIsEmpty">https://doc.qt.io/qt-5/qtglobal.html#qEnvironmentVariableIsEmpty</a>
</p>
</div>
</div>
</div>



<div id="outline-container-org534574e" class="outline-2">
<h2 id="org534574e">Implementations</h2>
</div>


<div id="outline-container-orgfa4fc33" class="outline-2">
<h2 id="orgfa4fc33">Wording</h2>
<div class="outline-text-2" id="text-orgfa4fc33">
</div>
<div id="outline-container-org572e044" class="outline-3">
<h3 id="org572e044">Feature Test Macro</h3>
<div class="outline-text-3" id="text-org572e044">
<p>
Set the <code>__cpp_lib_environment</code> feature test macro.
</p>
</div>
</div>
