env/std_environment.org
** Class template environment [.environment]

After ~value_or~ functions in synopsis at [expected.object.obs] add the following:

#+BEGIN_SRC C++
  template<class G = E> constexpr E error_or(G&&) const &;
  template<class G = E> constexpr E error_or(G&&) &&;

  // [expected.object.monadic], monadic operations
  template <class F> constexpr auto and_then(F&& f) &;
  template <class F> constexpr auto and_then(F&& f) &&;
  template <class F> constexpr auto and_then(F&& f) const &;
  template <class F> constexpr auto and_then(F&& f) const &&;
  template <class F> constexpr auto or_else(F&& f) &;
  template <class F> constexpr auto or_else(F&& f) &&;
  template <class F> constexpr auto or_else(F&& f) const &;
  template <class F> constexpr auto or_else(F&& f) const &&;
  template <class F> constexpr auto transform(F&& f) &;
  template <class F> constexpr auto transform(F&& f) &&;
  template <class F> constexpr auto transform(F&& f) const &;
  template <class F> constexpr auto transform(F&& f) const &&;
  template <class F> constexpr auto transform_error(F&& f) &;
  template <class F> constexpr auto transform_error(F&& f) &&;
  template <class F> constexpr auto transform_error(F&& f) const &;
  template <class F> constexpr auto transform_error(F&& f) const &&;

#+END_SRC

** [expected.object.general] changes

Replace paragragh 2 sentence 1 as follows:
+A program that instantiates the definition of template expected<T, E> for a reference type, a function type, or for possibly cv-qualified types in_place_t, unexpect_t, or a specialization of unexpected for the T parameter is ill-formed.+

with 

A type T is a /valid value type for =expected=/, if ~remove_cv_t<T>~ is ~void~ or a complete non-array object type that is not ~in_place_t~, ~unexpect_t~, or a specialization of ~unexpected~.  A program which instantiates class template ~expected<T, E>~ with an argument T that is not a valid value type for ~expected~ is ill-formed.

** Add following at the end [expected.object.obs] observers:

 1 ~template <class G = E> constexpr E error_or(G&& e) const &;~
    
   /Mandates:/ ~is_copy_constructible_v<E>~ is ~true~ and ~is_convertible_v<G, E>~ is ~true~.
  
   /Returns:/ ~std::forward<G>(e)~ if ~has_value()~ is ~true~, ~error()~ otherwise.

 2 ~template <class G = E> constexpr E error_or(G&& e) &&;~
    
   /Mandates:/ ~is_move_constructible_v<E>~ is ~true~ and ~is_convertible_v<G, E>~ is ~true~.
  
   /Returns:/ ~std::forward<G>(e)~ if ~has_value()~ is ~true~, ~std::move(error())~ otherwise.

* Acknowledgements
 - Thanks to Ben Craig for early review and advice on Freestanding.

* Revision History

| Version |       Date | Changes                                                                            |
|---------+------------+------------------------------------------------------------------------------------|
|       0 | 2023-01-15 | Initial Draft                                                                      |
|---------+------------+------------------------------------------------------------------------------------|

* References
  1. [P1275] Desert Sessions: Improving hostile environment interactions Isabella Muerte https://wg21.link/p1275r0
  2. getenv https://en.cppreference.com/w/cpp/utility/program/getenv
  3. A Proposal to Add Process Management to the C++ Standard Library https://wg21.link/P1750


  10. Source for this proposal https://github.com/JeffGarland/wg21work/tree/main/monadic_expected
