env/std_environment.html

<div id="outline-container-org57d13a6" class="outline-3">
<h3 id="org57d13a6">Class template environment [.environment]</h3>
<div class="outline-text-3" id="text-org57d13a6">
<p>
After <code>value_or</code> functions in synopsis at [expected.object.obs] add the following:
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">G</span> = <span style="color: #228b22;">E</span>&gt; constexpr <span style="color: #228b22;">E</span> <span style="color: #0000ff;">error_or</span>(<span style="color: #228b22;">G</span>&amp;&amp;) <span style="color: #a020f0;">const</span> &amp;;
<span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">G</span> = <span style="color: #228b22;">E</span>&gt; constexpr <span style="color: #228b22;">E</span> <span style="color: #0000ff;">error_or</span>(<span style="color: #228b22;">G</span>&amp;&amp;) &amp;&amp;;

<span style="color: #b22222;">// </span><span style="color: #b22222;">[expected.object.monadic], monadic operations</span>
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> and_then(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) &amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> and_then(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) &amp;&amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> and_then(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) <span style="color: #a020f0;">const</span> &amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> and_then(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) <span style="color: #a020f0;">const</span> &amp;&amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> or_else(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) &amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> or_else(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) &amp;&amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> or_else(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) <span style="color: #a020f0;">const</span> &amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> or_else(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) <span style="color: #a020f0;">const</span> &amp;&amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> transform(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) &amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> transform(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) &amp;&amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> transform(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) <span style="color: #a020f0;">const</span> &amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> transform(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) <span style="color: #a020f0;">const</span> &amp;&amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> transform_error(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) &amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> transform_error(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) &amp;&amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> transform_error(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) <span style="color: #a020f0;">const</span> &amp;;
<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">F</span>&gt; <span style="color: #228b22;">constexpr</span> <span style="color: #a020f0;">auto</span> transform_error(<span style="color: #228b22;">F</span>&amp;&amp; <span style="color: #a0522d;">f</span>) <span style="color: #a020f0;">const</span> &amp;&amp;;

</pre>
</div>
</div>
</div>

<div id="outline-container-org1814694" class="outline-3">
<h3 id="org1814694">[expected.object.general] changes</h3>
<div class="outline-text-3" id="text-org1814694">
<p>
Replace paragragh 2 sentence 1 as follows:
<del>A program that instantiates the definition of template expected&lt;T, E&gt; for a reference type, a function type, or for possibly cv-qualified types in<sub>place</sub><sub>t</sub>, unexpect<sub>t</sub>, or a specialization of unexpected for the T parameter is ill-formed.</del>
</p>

<p>
with 
</p>

<p>
A type T is a <i>valid value type for <code>expected</code></i>, if <code>remove_cv_t&lt;T&gt;</code> is <code>void</code> or a complete non-array object type that is not <code>in_place_t</code>, <code>unexpect_t</code>, or a specialization of <code>unexpected</code>.  A program which instantiates class template <code>expected&lt;T, E&gt;</code> with an argument T that is not a valid value type for <code>expected</code> is ill-formed.
</p>
</div>
</div>

<div id="outline-container-orgf4f4cd9" class="outline-3">
<h3 id="orgf4f4cd9">Add following at the end [expected.object.obs] observers:</h3>
<div class="outline-text-3" id="text-orgf4f4cd9">
<p>
1 <code>template &lt;class G = E&gt; constexpr E error_or(G&amp;&amp; e) const &amp;;</code>
</p>

<p>
<i>Mandates:</i> <code>is_copy_constructible_v&lt;E&gt;</code> is <code>true</code> and <code>is_convertible_v&lt;G, E&gt;</code> is <code>true</code>.
</p>

<p>
<i>Returns:</i> <code>std::forward&lt;G&gt;(e)</code> if <code>has_value()</code> is <code>true</code>, <code>error()</code> otherwise.
</p>

<p>
2 <code>template &lt;class G = E&gt; constexpr E error_or(G&amp;&amp; e) &amp;&amp;;</code>
</p>

<p>
<i>Mandates:</i> <code>is_move_constructible_v&lt;E&gt;</code> is <code>true</code> and <code>is_convertible_v&lt;G, E&gt;</code> is <code>true</code>.
</p>

<p>
<i>Returns:</i> <code>std::forward&lt;G&gt;(e)</code> if <code>has_value()</code> is <code>true</code>, <code>std::move(error())</code> otherwise.
</p>
</div>
</div>
</div>


<div id="outline-container-orgadb441c" class="outline-2">
<h2 id="orgadb441c">Acknowledgements</h2>
<div class="outline-text-2" id="text-orgadb441c">
<ul class="org-ul">
<li>Thanks to Ben Craig for early review and advice on Freestanding.</li>
</ul>
</div>
</div>

<div id="outline-container-org6aebd84" class="outline-2">
<h2 id="org6aebd84">Revision History</h2>
<div class="outline-text-2" id="text-org6aebd84">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Version</th>
<th scope="col" class="org-right">Date</th>
<th scope="col" class="org-left">Changes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">2022-12-18</td>
<td class="org-left">Initial Draft</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org14b3a66" class="outline-2">
<h2 id="org14b3a66">References</h2>
<div class="outline-text-2" id="text-org14b3a66">
<ol class="org-ol">
<li>[P1275] Desert Sessions: Improving hostile environment interactions Isabella Muerte <a href="https://wg21.link/p1275r0">https://wg21.link/p1275r0</a></li>
<li>getenv <a href="https://en.cppreference.com/w/cpp/utility/program/getenv">https://en.cppreference.com/w/cpp/utility/program/getenv</a></li>
<li>A Proposal to Add Process Management to the C++ Standard Library <a href="https://wg21.link/P1750">https://wg21.link/P1750</a></li>
</ol>


<ol class="org-ol">
<li>Source for this proposal <a href="https://github.com/JeffGarland/wg21work/tree/main/monadic_expected">https://github.com/JeffGarland/wg21work/tree/main/monadic_expected</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jeff Garland</p>
<p class="date">Created: 2023-01-15 Sun 04:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
